---
type: SpaceSet
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 10
tags: [revit-api, class]
---

# SpaceSet

`Autodesk.Revit.DB.Mechanical.SpaceSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpaceSet | — | `public SpaceSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Space item )` |
| Method | Erase | — | `public virtual int Erase ( Space item )` |
| Method | ForwardIterator | — | `public virtual SpaceSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Space item )` |
| Method | ReverseIterator | — | `public virtual SpaceSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |